### 02 판다스 시작하기

#### 02-1 데이터 집합 불러오기

* 갭마인더 데이터 집합 불러오기

In [3]:
# 판다스 라이브러리 가져오기
import pandas as pd

In [4]:
# csv파일 불러오기
# read_csv() 메서드
# '\t'으로 구분
gapDF = pd.read_csv("../datafiles/dataFiles/gapminder.tsv", sep="\t")

* 불러온 데이터 집합 살펴보기

In [6]:
# 가장 앞에 있는 5개의 행 출력
# head() 메서드
gapDF.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [9]:
# df의 자료형 출력
# type() 메서드
type(gapDF)

pandas.core.frame.DataFrame

In [11]:
# 데이터프레임의 행과 열의 크기에 대한 정보
# shape() 메서드
# ( 행, 열 )
gapDF.shape

(1704, 6)

In [14]:
# 열 출력
# columns
gapDF.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [15]:
# 데이터프레임을 구성하는 값의 자료형 확인
# dtypes
gapDF.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [16]:
# info()
gapDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

#### 02-2 데이터 추출하기

* 열 단위로 데이터 추출하기

In [17]:
# 열 이름이 country인 열 추출
# country_df에 저장
country_df = gapDF.country

In [20]:
# country_df의 타입
type(country_df)

pandas.core.series.Series

In [18]:
# 가장 앞에 있는 5개의 데이터
country_df.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [19]:
# 가장 뒤에 있는 5개의 데이터
country_df.tail()

1699    Zimbabwe
1700    Zimbabwe
1701    Zimbabwe
1702    Zimbabwe
1703    Zimbabwe
Name: country, dtype: object

In [21]:
# country, continent, year 열 추출
# subset에 저장
subset = gapDF[["country", "continent", "year"]]

In [22]:
# 가장 위에 있는 5개의 데이터
subset.head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [24]:
# 가장 밑에 있는 5개의 데이터
subset.tail()

       country continent  year
1699  Zimbabwe    Africa  1987
1700  Zimbabwe    Africa  1992
1701  Zimbabwe    Africa  1997
1702  Zimbabwe    Africa  2002
1703  Zimbabwe    Africa  2007

In [23]:
# subset의 타입
type(subset)

pandas.core.frame.DataFrame

* loc 속성으로 행 데이터 추출하기

In [25]:
# 인덱스가 0인 행 데이터 추출
gapDF.loc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object

In [28]:
# 인덱스가 99인 행 데이터 추출
gapDF.loc[99]

country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap    721.186086
Name: 99, dtype: object

In [27]:
# -1을 넣으면 마지막 행이 출력되는 것이 아니다!
# 인덱스가 -1인 행이 존재하지 않기 때문에 오류 발생
# gapDF.loc[-1]

In [31]:
# 데이터프레임의 마지막 행 데이터 추출
# 마지막 행 데이터의 인덱스 이용
# .loc[마지막 인덱스 - 1]
print(gapDF.shape[0])
gapDF.loc[1703]

1704

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [33]:
# tail 메서드 이용
print(gapDF.tail(1))
gapDF.loc[1703]

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [34]:
# 인덱스가 0, 99, 999인 데이터 추출
gapDF.loc[[0, 99, 999]]

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

* iloc 속성으로 행 데이터 출력하기

In [35]:
# 인덱스가 1인 행 데이터 추출
gapDF.iloc[1]

country      Afghanistan
continent           Asia
year                1957
lifeExp           30.332
pop              9240934
gdpPercap      820.85303
Name: 1, dtype: object

In [36]:
# 인덱스가 99인 행 데이터 추출
gapDF.iloc[99]

country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap    721.186086
Name: 99, dtype: object

In [37]:
# 마지막 행 데이터 추출
# iloc 속성은 음수 사용 가능!
gapDF.iloc[-1]

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [38]:
# 인덱스가 0, 99, 999인 데이터 추출
gapDF.iloc[[0, 99, 999]]

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

* 데이터 추출하기 - 슬라이싱 구문, range 메서드

In [43]:
# 슬라이싱 구문으로 데이터 추출
# 모든 행의 데이터에 대해 year, pop 열 추출
# loc 속성 --> 열 지정값에 문자열 리스트 전달
gapDF.loc[:, ["year", "pop"]].head()

   year       pop
0  1952   8425333
1  1957   9240934
2  1962  10267083
3  1967  11537966
4  1972  13079460

In [44]:
# iloc 속성 --> 열 지정값에 정수 리스트 전달
gapDF.iloc[:, [2, 4]].head()

   year       pop
0  1952   8425333
1  1957   9240934
2  1962  10267083
3  1967  11537966
4  1972  13079460

In [45]:
gapDF.iloc[:, [2, 4, -1]].head()

   year       pop   gdpPercap
0  1952   8425333  779.445314
1  1957   9240934  820.853030
2  1962  10267083  853.100710
3  1967  11537966  836.197138
4  1972  13079460  739.981106

In [47]:
# range 메서드로 데이터 추출
# 열 지정값 : range(5) --> [0, 1, 2, 3, 4]
# iloc 속성
gapDF.iloc[:, list(range(5))].head()

       country continent  year  lifeExp       pop
0  Afghanistan      Asia  1952   28.801   8425333
1  Afghanistan      Asia  1957   30.332   9240934
2  Afghanistan      Asia  1962   31.997  10267083
3  Afghanistan      Asia  1967   34.020  11537966
4  Afghanistan      Asia  1972   36.088  13079460

In [49]:
# 열 지정값 : range(3, 6) --> [3, 4, 5]
# iloc 속성
gapDF.iloc[:, list(range(3, 6))].head()

   lifeExp       pop   gdpPercap
0   28.801   8425333  779.445314
1   30.332   9240934  820.853030
2   31.997  10267083  853.100710
3   34.020  11537966  836.197138
4   36.088  13079460  739.981106

In [50]:
# 0 부터 5까지 2만큼 건너뛰기
# 열 지정값 : range(0, 5, 2) --> [0, 2, 4]
# iloc 속성
gapDF.iloc[:, list(range(0, 5, 2))].head()

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083
3  Afghanistan  1967  11537966
4  Afghanistan  1972  13079460

In [53]:
# 슬라이싱 구문과 range 메서드 비교
# 2까지의 열 추출
# 슬라이싱
print(gapDF.iloc[:, :3].head())

# range 메서드
gapDF.iloc[:, list(range(3))].head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [54]:
# 0에서 6까지 2만큼 건너뛰기
# 슬라이싱
print(gapDF.iloc[:, 0:6:2].head())

# range 메서드
gapDF.iloc[:, list(range(0, 6, 2))].head()

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083
3  Afghanistan  1967  11537966
4  Afghanistan  1972  13079460

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083
3  Afghanistan  1967  11537966
4  Afghanistan  1972  13079460

In [55]:
# iloc 속성
# 0, 99, 999번째 행
# 0, 3, 5번째 열
gapDF.iloc[[0, 99, 999], [0, 3, 5]]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [57]:
# loc 속성
# 0, 99, 999번째 행
# 0, 3, 5번째 열 --> country, lifeExp, gdpPercap
gapDF.loc[[0, 99, 999], ["country", "lifeExp", "gdpPercap"]]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [60]:
# 10에서 13번째 행
# country, lifeExp, gdpPercap 열
gapDF.loc[10:13, ["country", "lifeExp", "gdpPercap"]]

        country  lifeExp    gdpPercap
10  Afghanistan   42.129   726.734055
11  Afghanistan   43.828   974.580338
12      Albania   55.230  1601.056136
13      Albania   59.280  1942.284244

### 03 판다스 데이터프레임과 시리즈

#### 03-1 나만의 데이터 만들기

* 시리즈와 데이터프레임 직접 만들기

In [62]:
# 시리즈 만들기
s = pd.Series(['banana', '42'])
s

0    banana
1        42
dtype: object

In [64]:
# 시리즈 인덱스 지정
# Series / index 메서드
s1 = pd.Series(["Wes McKinney", "Creator of Pandas"], index = ['Person', 'Who'])
s1

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [65]:
# 데이터프레임 만들기
# 딕셔너리를 DataFrame 클래스에 전달
scientists = pd.DataFrame({'Name':['Rosaline Franklin', 'William Gosset'], 'Occupation':['Chemist', 'Statistician'], 'Born':['1920-07-25', '1876-06-13'], 'Died':['1958-04-06', '1937-10-16'], 'Age':[37, 61]})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-06   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [66]:
# 데이터 프레임 인덱스 지정
# columns 인자 --> 여기서 지정한 값 순서대로 출력
scientists = pd.DataFrame({'Occupation':['Chemist', 'Statistician'], 'Born':['1920-07-25', '1876-06-13'], 'Died':['1958-04-06', '1937-10-16'], 'Age':[37, 61]}, index=['Rosaline Franklin', 'William Gosset'], columns=['Occupation', 'Born', 'Age', 'Died'])
scientists

                     Occupation        Born  Age        Died
Rosaline Franklin       Chemist  1920-07-25   37  1958-04-06
William Gosset     Statistician  1876-06-13   61  1937-10-16

In [67]:
# 순서가 보장된 딕셔너리로 데이터프레임 만들기
from collections import OrderedDict

scientists = pd.DataFrame(OrderedDict([('Name', ['Rosaline Franklin', 'William Gosset']), ('Occupation', ['Chemist', 'Statistician']), ('Born', ['1920-07-25', '1876-06-13']), ('Died', ['1958-04-06', '1937-10-16']), ('Age', [37, 61])]))
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-06   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

#### 03-2 시리즈 다루기 - 기초

* 데이터프레임에서 시리즈 선택하기

In [73]:
# scientists에서 William Gosset 시리즈 불러오기
# loc 속성
scientists = pd.DataFrame({'Occupation':['Chemist', 'Statistician'], 'Born':['1920-07-25', '1876-06-13'], 'Died':['1958-04-06', '1937-10-16'], 'Age':[37, 61]}, index=['Rosaline Franklin', 'William Gosset'], columns=['Occupation', 'Born', 'Age', 'Died'])
print(scientists)

first_row = scientists.loc["William Gosset"]
first_row

                     Occupation        Born  Age        Died
Rosaline Franklin       Chemist  1920-07-25   37  1958-04-06
William Gosset     Statistician  1876-06-13   61  1937-10-16

Occupation    Statistician
Born            1876-06-13
Age                     61
Died            1937-10-16
Name: William Gosset, dtype: object

In [74]:
# 타입 확인
type(first_row)

pandas.core.series.Series

* index, values 속성과 keys 메서드 사용하기

In [75]:
# index 속성
first_row.index

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [76]:
# values 속성
first_row.values

array(['Statistician', '1876-06-13', 61, '1937-10-16'], dtype=object)

In [77]:
# keys 메서드
first_row.keys()

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [78]:
# index 속성 응용
# 첫 번째 값 추출
first_row.index[0]

'Occupation'

In [79]:
# keys 메서드 응용
# 첫 번쨰 값 추출
first_row.keys()[0]

'Occupation'

* 시리즈의 mean, min, max, std 메서드 사용하기

In [81]:
# scientists의 Age 열 추출
ages = scientists.Age
ages

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [83]:
# mean, min, max, std
print(ages.mean())
print(ages.min())
print(ages.max())
print(ages.std())

49.0
37
61
16.97056274847714

#### 03-3 시리즈 다루기 - 응용

* 시리즈와 불린 추출 사용하기

In [84]:
# scientists.csv 불러오기
scientists = pd.read_csv("../datafiles/dataFiles/scientists.csv")
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [85]:
# Age 열 추출
# max, mean 메서드
ages = scientists.Age
print(ages.max())
print(ages.mean())

90
59.125

In [86]:
# 평균 나이보다 나이가 많은 사람의 데이터 추출
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [87]:
# 위는 조건식을 만족한 값들만 출력해준다 (True)
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

* 벡터와 스칼라로 브로드캐스팅 수행하기

In [88]:
# 같은 길이의 벡터로 더하기 연산 수행
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [89]:
# 같은 길이의 벡터로 곱하기 연산 수행
ages * ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [91]:
# 벡터에 스칼라 연산 수행
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [93]:
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [94]:
# 길이가 다른 벡터 연산
# 인덱스가 일치한 값만 계산
# 나머지는 누락값(NaN)으로 처리
print(pd.Series([1, 100]))

print(ages + pd.Series([1, 100]))

0      1
1    100
dtype: int64
0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [96]:
# sort_index 메서드
# ascending = False --> 내림차순
rev_ages = ages.sort_index(ascending=False)
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [97]:
# 벡터와 벡터의 연산은 일치하는 인덱스의 값끼리 수행
# 따라서, 아래 두개의 결과는 같다
print(ages * 2)

print(ages + rev_ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64
0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

#### 03-4 데이터프레임 다루기

* 불린 추출과 브로드캐스팅

In [99]:
# 불린 추출하기
# Age 열에서 Age 열의 평균보다 높은 행만 추출
scientists[scientists.Age > scientists.Age.mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [101]:
# 데이터프레임의 loc속성에 bool 벡터 전달
# Trued인 행만 출력
scientists.loc[[True, True, False, True, True, True, False, True]]

                Name        Born        Died  Age     Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37        Chemist
1     William Gosset  1876-06-13  1937-10-16   61   Statistician
3        Marie Curie  1867-11-07  1934-07-04   66        Chemist
4      Rachel Carson  1907-05-27  1964-04-14   56      Biologist
5          John Snow  1813-03-15  1858-06-16   45      Physician
7       Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [102]:
# 브로드캐스팅
# 데이터프레임 * 2
# 문자열 : 2배로 늘어남
# 정  수 : 2를 곱한 값
scientists * 2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

#### 03-5 시리즈와 데이터프레임의 데이터 처리하기

In [104]:
# scientists의 Born과 Died 열의 자료형 확인
print(scientists.Born.dtype, scientists.Died.dtype, sep='\n')

object
object

In [112]:
# Born과 Died 열의 자료형을 datetime 자료형으로 변경
# %Y-%m-%d format으로 지정
import datetime
born_datetime = pd.to_datetime(scientists.Born, format="%Y-%m-%d")
print(born_datetime, end='\n\n')

died_datetime = pd.to_datetime(scientists.Died, format="%Y-%m-%d")
print(died_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [115]:
# 데이터프레임에 위의 열 추가
# born_dt, died_dt
scientists['born_dt'], scientists['died_dt'] = (born_datetime, died_datetime)
scientists.head()

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14

In [116]:
# 데이터프레임의 형태
scientists.shape

(8, 7)

In [117]:
# 과학자가 세상을 산 날짜 계산
# died_dt - born_dt
scientists["age_days_dt"] = scientists.died_dt - scientists.born_dt
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [118]:
# 시리즈, 데이터프레임의 데이터 섞기
# Age값 출력
scientists.Age

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [119]:
# random 라이브러리 불러오기
import random as rd

In [123]:
# shuffle 메서드
rd.shuffle(scientists.Age)
scientists.Age

c:\Users\user\AppData\Local\Programs\Python\Python311\Lib\random.py:380: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[i], x[j] = x[j], x[i]

0    37
1    45
2    90
3    41
4    56
5    61
6    77
7    66
Name: Age, dtype: int64

In [124]:
# 데이터프레임의 열 삭제하기
# 먼저 scientists 열 확인
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

In [126]:
# drop 메서드
# Age 열 삭제
scientists_dropped = scientists.drop(["Age"], axis=1)
scientists_dropped.columns

Index(['Name', 'Born', 'Died', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

#### 03-6 데이터 저장하고 불러오기

* 데이터를 피클, CSV, TSV 파일로 저장하고 불러오기

In [129]:
# 피클로 저장하기
names = scientists.Name
names.to_pickle('../WORK/scientists_names_series.pickle')

In [131]:
# 데이터 불러오기
scientists_names_from_pickle = pd.read_pickle('../WORK/scientists_names_series.pickle')
scientists_names_from_pickle

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [132]:
# CSV파일과 TSV 파일로 저장하기
names.to_csv('../WORK/scientists_names_series.csv')
scientists.to_csv('../WORK/scientists_df.tsv', sep='\t')